core/src/main/resources/order_template/changeimsi.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:oed="http://tot.co.th/totom/interface/oedata">
   <soapenv:Header/>
   <soapenv:Body>
      <oed:SubmitRequest>
         <OrderId>{5}</OrderId>
         <SourceSystemId>OMWeb</SourceSystemId>
         <OrderUserId>{4}</OrderUserId>
         <OrderDateTime>{3}</OrderDateTime>
         <OrderType>SUBMIT</OrderType>
         <OperationCode>MODSIM</OperationCode>
         <OrderItems>
            <OrderItem>
               <OrderItemType>ACCESS</OrderItemType>
               <OrderItemAction>MOD</OrderItemAction>
               <OrderItemId>ACCESS{5}</OrderItemId>
               <OrderItemParentId/>
            </OrderItem>
            <OrderItem>
               <OrderItemType>SIM</OrderItemType>
               <OrderItemAction>DEL</OrderItemAction>
               <OrderItemId>SIM{5}</OrderItemId>
               <OrderItemParentId>ACCESS{5}</OrderItemParentId>
               <Attributes>
                  <Attribute>
                     <Name>IMSI</Name>
                     <Value>{2}</Value>
                  </Attribute>
               </Attributes>
            </OrderItem>
            <OrderItem>
               <OrderItemType>SIM</OrderItemType>
               <OrderItemAction>ADD</OrderItemAction>
               <OrderItemId>SIMNEW{5}</OrderItemId>
               <OrderItemParentId>ACCESS{5}</OrderItemParentId>
               <Attributes>
                  <Attribute>
                     <Name>IMSI</Name>
                     <Value>{1}</Value>
                  </Attribute>
               </Attributes>
            </OrderItem>
            <OrderItem>
               <OrderItemType>MSISDN</OrderItemType>
               <OrderItemAction>REF</OrderItemAction>
               <OrderItemId>MSISDN{5}</OrderItemId>
               <OrderItemParentId>ACCESS{5}</OrderItemParentId>
               <Attributes>
                  <Attribute>
                     <Name>Number</Name>
                     <Value>{0}</Value>
                  </Attribute>
               </Attributes>
	        </OrderItem>
         </OrderItems>
      </oed:SubmitRequest>
   </soapenv:Body>
</soapenv:Envelope>
